---
kind: property
id: P:Autodesk.Revit.DB.Visual.AssetPropertyBoolean.Value
source: html/d12fbcbd-5527-33ea-e0b3-3fc8ae94bde0.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyBoolean.Value Property

The value of the property.

## Syntax (C#)
```csharp
public bool Value { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The input value is invalid for this AssetPropertyBoolean property.
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: The asset property is not editable.